{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.10.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/hidden3_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/hidden3_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/output_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "7"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/output_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}}}, {"name": "inputs", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/mul_1", "op": "Mul", "input": ["inputs", "StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/mul_1", "StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/hidden3_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/add_1", "StatefulPartitionedCall/sequential_1/hidden3_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/hidden3_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/sequential_1/output_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/hidden3_1/Relu", "StatefulPartitionedCall/sequential_1/output_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/output_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_1/output_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_1/output_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/output_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1882}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/mul", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_1/batchnorm/sub", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/hidden3_1/Cast/ReadVariableOp", "shape": [3, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/hidden3_1/Add/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/output_1/Cast/ReadVariableOp", "shape": [16, 7], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/output_1/Add/ReadVariableOp", "shape": [7], "dtype": "float32"}]}]}